In [1]:
data = {"orange":["kashmir","ooty","bglr"],
       "apple":["chennai","delhi","kodai"]}
print(data)

{'orange': ['kashmir', 'ooty', 'bglr'], 'apple': ['chennai', 'delhi', 'kodai']}

In [2]:
import pandas as pd

# Working with DataFrame

In [3]:
fruit_df = pd.DataFrame(data)

In [4]:
fruit_df.head()

    orange    apple
0  kashmir  chennai
1     ooty    delhi
2     bglr    kodai

In [5]:
fruit_df = pd.DataFrame(data,index=["jan","feb","mar"])
fruit_df.head()

      orange    apple
jan  kashmir  chennai
feb     ooty    delhi
mar     bglr    kodai

In [6]:
fruit_df.loc["feb"]

orange     ooty
apple     delhi
Name: feb, dtype: object

In [7]:
test = pd.DataFrame(fruit_df.loc["feb"])
test.head()

          feb
orange   ooty
apple   delhi

# Working with .csv File

In [8]:
movieDf = pd.read_csv("/home/labuser/Downloads/IMDB-Movie-Data.csv", index_col=0)
movieDf.head()

,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Rank,,,,,,,,,,,
1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0

In [9]:
movieDf.tail()

,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Rank,,,,,,,,,,,
996,Secret in Their Eyes,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585,NaN,45.0
997,Hostel: Part II,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.54,46.0
998,Step Up 2: The Streets,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
999,Search Party,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
1000,Nine Lives,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

In [10]:
movieDf.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 1 to 1000
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Title               1000 non-null   object
 1   Genre               1000 non-null   object
 2   Description         1000 non-null   object
 3   Director            1000 non-null   object
 4   Actors              1000 non-null   object
 5   Year                1000 non-null   int64
 6   Runtime (Minutes)   1000 non-null   int64
 7   Rating              1000 non-null   float64
 8   Votes               1000 non-null   int64
 9   Revenue (Millions)  872 non-null    float64
 10  Metascore           936 non-null    float64
dtypes: float64(3), int64(3), object(5)
memory usage: 93.8+ KB

In [11]:
movieDf.shape

(1000, 11)

In [12]:
testDf = movieDf.append(movieDf)
testDf.shape

/tmp/ipykernel_1967/3561731202.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  testDf = movieDf.append(movieDf)

(2000, 11)

In [13]:
finalDf = testDf.drop_duplicates(keep=False)
finalDf.shape

(0, 11)

In [14]:
finalDf = testDf.drop_duplicates(keep="last")
finalDf.shape

(1000, 11)

In [15]:
finalDf.columns

Index(['Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [16]:
finalDf.rename(columns={"Runtime (Minutes)":"Runtime","Revenue (Millions)":"Revenue"},inplace=True)

/tmp/ipykernel_1967/2902641733.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  finalDf.rename(columns={"Runtime (Minutes)":"Runtime","Revenue (Millions)":"Revenue"},inplace=True)

In [17]:
finalDf.columns

Index(['Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime', 'Rating', 'Votes', 'Revenue', 'Metascore'],
      dtype='object')

In [18]:
finalDf.columns = [col.lower() for col in finalDf.columns]
finalDf.columns

Index(['title', 'genre', 'description', 'director', 'actors', 'year',
       'runtime', 'rating', 'votes', 'revenue', 'metascore'],
      dtype='object')

In [19]:
finalDf.columns = [col.upper() for col in finalDf.columns]
finalDf.columns

Index(['TITLE', 'GENRE', 'DESCRIPTION', 'DIRECTOR', 'ACTORS', 'YEAR',
       'RUNTIME', 'RATING', 'VOTES', 'REVENUE', 'METASCORE'],
      dtype='object')

In [20]:
finalDf.head()

,TITLE,GENRE,DESCRIPTION,DIRECTOR,ACTORS,YEAR,RUNTIME,RATING,VOTES,REVENUE,METASCORE
Rank,,,,,,,,,,,
1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0

In [21]:
finalDf.index

Int64Index([   1,    2,    3,    4,    5,    6,    7,    8,    9,   10,
            ...
             991,  992,  993,  994,  995,  996,  997,  998,  999, 1000],
           dtype='int64', name='Rank', length=1000)

In [22]:
finalDf.index.name = finalDf.index.name.upper()

In [23]:
finalDf.isnull().sum()

TITLE            0
GENRE            0
DESCRIPTION      0
DIRECTOR         0
ACTORS           0
YEAR             0
RUNTIME          0
RATING           0
VOTES            0
REVENUE        128
METASCORE       64
dtype: int64

In [24]:
testDf = finalDf.dropna()
testDf.isnull().sum()
testDf.shape

(838, 11)

In [25]:
finalDf.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 1 to 1000
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   TITLE        1000 non-null   object
 1   GENRE        1000 non-null   object
 2   DESCRIPTION  1000 non-null   object
 3   DIRECTOR     1000 non-null   object
 4   ACTORS       1000 non-null   object
 5   YEAR         1000 non-null   int64
 6   RUNTIME      1000 non-null   int64
 7   RATING       1000 non-null   float64
 8   VOTES        1000 non-null   int64
 9   REVENUE      872 non-null    float64
 10  METASCORE    936 non-null    float64
dtypes: float64(3), int64(3), object(5)
memory usage: 93.8+ KB

In [26]:
testDf = finalDf.dropna(axis=1)
testDf.isnull().sum()
testDf.shape

(1000, 9)

In [27]:
testDf = finalDf.dropna(subset=["METASCORE"])
testDf.isnull().sum()
testDf.shape

(936, 11)

In [28]:
testDf = finalDf.dropna(thresh=2)
testDf.isnull().sum()
testDf.shape

(1000, 11)

In [29]:
testDf = finalDf.dropna(thresh=10)
testDf.isnull().sum()
testDf.shape

(970, 11)

In [30]:
revenue = finalDf['REVENUE']
revenue.fillna(revenue.mean(),inplace=True)
finalDf.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 1 to 1000
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   TITLE        1000 non-null   object
 1   GENRE        1000 non-null   object
 2   DESCRIPTION  1000 non-null   object
 3   DIRECTOR     1000 non-null   object
 4   ACTORS       1000 non-null   object
 5   YEAR         1000 non-null   int64
 6   RUNTIME      1000 non-null   int64
 7   RATING       1000 non-null   float64
 8   VOTES        1000 non-null   int64
 9   REVENUE      1000 non-null   float64
 10  METASCORE    936 non-null    float64
dtypes: float64(3), int64(3), object(5)
memory usage: 93.8+ KB

In [31]:
metascore = finalDf['METASCORE']
metascore.fillna(metascore.mean(),inplace=True)
finalDf.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 1 to 1000
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   TITLE        1000 non-null   object
 1   GENRE        1000 non-null   object
 2   DESCRIPTION  1000 non-null   object
 3   DIRECTOR     1000 non-null   object
 4   ACTORS       1000 non-null   object
 5   YEAR         1000 non-null   int64
 6   RUNTIME      1000 non-null   int64
 7   RATING       1000 non-null   float64
 8   VOTES        1000 non-null   int64
 9   REVENUE      1000 non-null   float64
 10  METASCORE    1000 non-null   float64
dtypes: float64(3), int64(3), object(5)
memory usage: 93.8+ KB

In [32]:
print("Mean Revenue : ",revenue.mean())
print("Mean Metascore : ",metascore.mean())

Mean Revenue :  82.95637614678898
Mean Metascore :  58.98504273504273

In [33]:
finalDf.describe()

,YEAR,RUNTIME,RATING,VOTES,REVENUE,METASCORE
count,1000.000000,1000.000000,1000.000000,1.000000e+03,1000.000000,1000.000000
mean,2012.783000,113.172000,6.723200,1.698083e+05,82.956376,58.985043
std,3.205962,18.810908,0.945429,1.887626e+05,96.412043,16.634858
min,2006.000000,66.000000,1.900000,6.100000e+01,0.000000,11.000000
25%,2010.000000,100.000000,6.200000,3.630900e+04,17.442500,47.750000
50%,2014.000000,111.000000,6.800000,1.107990e+05,60.375000,58.985043
75%,2016.000000,123.000000,7.400000,2.399098e+05,99.177500,71.000000
max,2016.000000,191.000000,9.000000,1.791916e+06,936.630000,100.000000

In [34]:
finalDf['REVENUE'].describe()

count    1000.000000
mean       82.956376
std        96.412043
min         0.000000
25%        17.442500
50%        60.375000
75%        99.177500
max       936.630000
Name: REVENUE, dtype: float64

In [35]:
finalDf["REVENUE"].value_counts()

82.956376     128
0.030000        7
0.010000        5
0.020000        4
0.040000        4
             ...
209.810000      1
65.270000       1
5.690000        1
37.550000       1
19.640000       1
Name: REVENUE, Length: 815, dtype: int64

In [37]:
finalDf.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 1 to 1000
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   TITLE        1000 non-null   object
 1   GENRE        1000 non-null   object
 2   DESCRIPTION  1000 non-null   object
 3   DIRECTOR     1000 non-null   object
 4   ACTORS       1000 non-null   object
 5   YEAR         1000 non-null   int64
 6   RUNTIME      1000 non-null   int64
 7   RATING       1000 non-null   float64
 8   VOTES        1000 non-null   int64
 9   REVENUE      1000 non-null   float64
 10  METASCORE    1000 non-null   float64
dtypes: float64(3), int64(3), object(5)
memory usage: 93.8+ KB

In [53]:
compDf = finalDf[['TITLE','GENRE','REVENUE']]
compDf.head()

                        TITLE                     GENRE  REVENUE
RANK
1     Guardians of the Galaxy   Action,Adventure,Sci-Fi   333.13
2                  Prometheus  Adventure,Mystery,Sci-Fi   126.46
3                       Split           Horror,Thriller   138.12
4                        Sing   Animation,Comedy,Family   270.32
5               Suicide Squad  Action,Adventure,Fantasy   325.02

In [54]:
compDf.iloc[1:4]

           TITLE                     GENRE  REVENUE
RANK
2     Prometheus  Adventure,Mystery,Sci-Fi   126.46
3          Split           Horror,Thriller   138.12
4           Sing   Animation,Comedy,Family   270.32

In [55]:
compDf.loc[2]

TITLE                    Prometheus
GENRE      Adventure,Mystery,Sci-Fi
REVENUE                      126.46
Name: 2, dtype: object

In [56]:
compDf[compDf['TITLE']=='Split']

      TITLE            GENRE  REVENUE
RANK
3     Split  Horror,Thriller   138.12

In [63]:
compDf[(compDf['TITLE']=='Split') | (compDf['TITLE']=='Sing')]

      TITLE                    GENRE  REVENUE
RANK
3     Split          Horror,Thriller   138.12
4      Sing  Animation,Comedy,Family   270.32

In [65]:
compDf[compDf['TITLE'].isin(['Split','Sing'])]

      TITLE                    GENRE  REVENUE
RANK
3     Split          Horror,Thriller   138.12
4      Sing  Animation,Comedy,Family   270.32

In [66]:
def ratingFunc(rating):
    if rating>=5.0:
        return 'Good'
    else:
        return 'Bad'

In [67]:
finalDf['MOVIE_RATING_VALUE'] = finalDf['RATING'].apply(ratingFunc)

In [68]:
finalDf.head(10)

,TITLE,GENRE,DESCRIPTION,DIRECTOR,ACTORS,YEAR,RUNTIME,RATING,VOTES,REVENUE,METASCORE,MOVIE_RATING_VALUE
RANK,,,,,,,,,,,,
1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.130000,76.0,Good
2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.460000,65.0,Good
3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.120000,62.0,Good
4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.320000,59.0,Good
5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.020000,40.0,Good
6,The Great Wall,"Action,Adventure,Fantasy",European mercenaries searching for black powde...,Yimou Zhang,"Matt Damon, Tian Jing, Willem Dafoe, Andy Lau",2016,103,6.1,56036,45.130000,42.0,Good
7,La La Land,"Comedy,Drama,Music",A jazz pianist falls for an aspiring actress i...,Damien Chazelle,"Ryan Gosling, Emma Stone, Rosemarie DeWitt, J....",2016,128,8.3,258682,151.060000,93.0,Good
8,Mindhorn,Comedy,A has-been actor best known for playing the ti...,Sean Foley,"Essie Davis, Andrea Riseborough, Julian Barrat...",2016,89,6.4,2490,82.956376,71.0,Good
9,The Lost City of Z,"Action,Adventure,Biography","A true-life drama, centering on British explor...",James Gray,"Charlie Hunnam, Robert Pattinson, Sienna Mille...",2016,141,7.1,7188,8.010000,78.0,Good
10,Passengers,"Adventure,Drama,Romance",A spacecraft traveling to a distant colony pla...,Morten Tyldum,"Jennifer Lawrence, Chris Pratt, Michael Sheen,...",2016,116,7.0,192177,100.010000,41.0,Good

In [69]:
import matplotlib.pyplot as plt

Matplotlib is building the font cache; this may take a moment.

In [70]:
import numpy as np

In [71]:
arr1d = np.array([1,2,3,4])

In [72]:
print(arr1d)

[1 2 3 4]

In [76]:
arr2d = np.array([[1,2,3,4],[5,6,7,8]])
print(arr2d)

[[1 2 3 4]
 [5 6 7 8]]

In [88]:

my_list = [1, 2, 3, 4, 5]
print(sum(my_list)/len(my_list))

3.0

In [89]:
import time

In [90]:
timestamp = 1632069752

In [93]:
format = time.strftime('%Y-%m-%d',time.localtime(timestamp))

In [94]:
print(format)

2021-09-19

In [98]:
import datetime
datetime.datetime.utcfromtimestamp(timestamp).strftime('%Y-%m-%d%H:%M:%S')

'2021-09-1916:42:32'